README.md
```mermaid
    sequenceDiagram
        title Shortening Request Flow
    actor User
    participant Server
    participant Cache
    participant DB
    User ->> Server : Send shortening request
    alt Exist in Cache 
        Server ->> Cache : Check the url exist in the cache.
        Cache ->> User : If exist, reponse the short url.
    else Exist in DB but not in Cache
        Server ->> DB : Query the url in the db.
        Server ->> Cache: If exist, save in cache.
        Server ->> User: Reponse the short url.
    end
    Server ->> DB: Generated the short URL and store in db
    Server ->> User: Reponse the short URL.
```
