README.md
```mermaid
    sequenceDiagram
        title Redirection Request Flow
    actor User 
    participant Server
    participant Cache
    participant DB
    
    User ->> Server : Send redirection request
    alt Exist in Cache
        Server -> Cache : Check the url_key exist in the cache.
        Cache -> User : If exist, reponse the original url.
    else Exist in Database but not in Cache
        Server ->> DB : Query the url_key in the db.
        Server ->> Cache: If exist, save in cache.
        Server ->> User: Reponse the original url.
    end
    Server ->> User: Reponse url_key do not exist.
```
